contingent/application/contingent-area/src/test/resources/xml/searchArea2538.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:user="http://emias.mos.ru/system/v1/userContext/"
               xmlns:typ="http://emias.mos.ru/contingent2/area/v3/types/"
               xmlns:v3="http://emias.mos.ru/contingent2/core/v3/"
               xmlns:v31="http://emias.mos.ru/contingent2/address/v3/">
    <soap:Body>
        <typ:searchAreaRequest>
            <!--Optional:-->
            <typ:areaTypeCode>20</typ:areaTypeCode>
            <typ:areaTypeCode>10</typ:areaTypeCode>
            <typ:isArchived>false</typ:isArchived>
            <!--Zero or more repetitions:-->
            <typ:address>
                <v31:globalIdNsi>-100</v31:globalIdNsi>
                <v31:regionOMKTEcode>-100</v31:regionOMKTEcode>
            </typ:address>
        </typ:searchAreaRequest>
    </soap:Body>
</soap:Envelope>